{
  "dir": "rtl",
  "rss": {
    "title": "رومان بونجيبو - المشاريع",
    "description": "اكتشف مشاريع رومان بونجيبو",
    "generator": "غير معروف",
    "copyright": "بونجيبو رومان، {year}. جميع الحقوق محفوظة."
  },
  "home": {
    "metadata": {
      "title": "بونجيبو رومان - المحفظة",
      "description": "محفظة رومان بونجيبو، طالب علوم الحاسوب في INSA تولوز. اكتشف مشاريعي ومقالاتي وخبراتي.",
      "keywords": "محفظة، علوم الحاسوب، طالب، INSA تولوز، مشاريع، مقالات، خبرات، توصيات، شهادات، تعليم"
    }
  },
  "components": {
    "header": {
      "title": "رومان بونجيبو",
      "subtitle": "طالب السنة الخامسة في علوم الحاسوب والشبكات في INSA تولوز",
      "availability": "مطور حر - متاح للمشاريع"
    },
    "footer": {
      "copyright": "© بونجيبو رومان، {year}. جميع الحقوق محفوظة."
    },
    "projects": {
      "title": "المشاريع"
    },
    "experience": {
      "title": "الخبرة",
      "lexlau": {
        "title": "متدرب مطور Full Stack",
        "date": "يونيو 2025 - أغسطس 2025",
        "location": "LexLau، 1000 بروكسل، بلجيكا",
        "description": "المساهمة في تطوير وتحسين نظام CRM/CMS ويب (Vue.js، .NET): إضافة وظائف رئيسية (إدارة الملفات، المصادقة، إنشاء المستندات)، تحسين واجهة المستخدم والأداء، الاختبار والصيانة بالتعاون مع الفريق التقني."
      },
      "gerresheimer": {
        "title": "متدرب مهندس شبكات",
        "date": "يوليو 2024 - أغسطس 2024",
        "location": "Gerresheimer، 6590 مومينيس، بلجيكا",
        "description": "المشاركة في تحسين البنية التحتية للشبكات في موقع صناعي: التدقيق وتعزيز الأمن، تكوين ومراقبة معدات الشبكة، الإدارة الاستباقية لخزانة الخوادم (التصحيح، التنظيم، التوثيق)"
      },
      "maloc": {
        "title": "مطور Backend",
        "date": "يوليو 2021 - أغسطس 2021",
        "location": "Maloc، 76600 لو هافر، فرنسا",
        "description": "تطوير واجهة برمجة تطبيقات REST قوية في Node.js باستخدام إطار عمل AdonisJS: نمذجة قاعدة البيانات، إدارة المصادقة، إنشاء نقاط النهاية التجارية. العمل بتعاون وثيق مع فريق Frontend لضمان التكامل السلس للوظائف والاتساق بين طبقات التطبيق."
      }
    },
    "education": {
      "title": "التعليم",
      "insa": {
        "title": "دبلوم هندسة في علوم الحاسوب والشبكات",
        "date": "2023 - 2026",
        "location": "المعهد الوطني للعلوم التطبيقية، 31400 تولوز، فرنسا",
        "description": "تدريب يركز على تطوير البرمجيات والشبكات والخوارزميات والأمن السيبراني. عززت مهاراتي في البرمجة والرياضيات التطبيقية وإدارة المشاريع التقنية."
      },
      "faidherbe": {
        "title": "الصف التحضيري للمدارس العليا",
        "date": "2021 - 2023",
        "location": "ثانوية فيدهيرب، 59034 ليل، فرنسا",
        "description": "سنتان مكثفتان حيث عززت أسسي العلمية مع تطوير منهجية عمل قوية. مكنني هذا التدريب من التقدم في المنطق والنمذجة وعلوم الحاسوب."
      },
      "isp": {
        "title": "البكالوريا العامة",
        "date": "2018 - 2021",
        "location": "مؤسسة سان بيير، 59610 فورميس، فرنسا",
        "description": "التخصصات: الرياضيات، الفيزياء والكيمياء، علوم الحياة والأرض - خيار الرياضيات المتقدمة. أكد هذا المسار اهتمامي بالعلوم وأعد الأرضية لدراساتي الهندسية."
      }
    },
    "certificates": {
      "title": "الشهادات",
      "web": {
        "title": "تدريب مطور ويب",
        "description": "تدريب شامل في تطوير الويب (HTML، CSS، JavaScript، PHP، MySQL، WordPress...) مع إنجاز مشاريع ملموسة: موقع عرض، مدونة، لعبة، تجارة إلكترونية، إلخ."
      },
      "toeic": {
        "title": "شهادة TOEIC® - 885 / 990",
        "description": "اختبار الاستماع والقراءة (INSA تولوز، 2025) - الاستماع: 470 / القراءة: 415 - مستوى متقدم، النتيجة صالحة حتى مايو 2027."
      },
      "java": {
        "title": "تدريب مطور Java",
        "description": "تدريب شامل في تطوير Java (Java 8 إلى 17) يتضمن 45 ورشة عمل عملية، تعلم تدريجي للأساسيات الموجهة للمشروع، مع مقدمة إلى Java EE، Maven و Spring Boot."
      },
      "vue": {
        "title": "تدريب Vue.js 3 الكامل",
        "description": "تدريب شامل في Vue.js 3 لإتقان إنشاء واجهات تفاعلية، وتطبيقات ويب SPA والجوال، مع تعلم المكونات، والتوجيهات، وإدارة الحالة (Vuex، Pinia)."
      }
    },
    "skills": {
      "title": "المهارات",
      "html-css": "إتقان التقنيات الأساسية للويب، مما يسمح بإنشاء مواقع وتطبيقات تفاعلية ومتجاوبة.",
      "javascript": "استخدام JavaScript لتطوير الويب، مع اهتمام خاص بالأداء وتجربة المستخدم.",
      "typescript": "معظم مشاريعي مطورة بـ TypeScript، مما يسمح لي بكتابة كود أكثر قوة وقابلية للصيانة.",
      "next-js": "استخدام React و Next.js لتطوير تطبيقات ويب حديثة وعالية الأداء ومحسنة (مثل هذه المحفظة).",
      "react": "استخدام React لتطوير واجهات مستخدم حديثة وتفاعلية.",
      "vue-js": "استخدام Vue.js لإنشاء نظام CRM/CMS تعاوني، مع اهتمام خاص بالأداء وتجربة المستخدم.",
      "node-js": "تطوير تطبيقات backend باستخدام Node.js، باستخدام أطر عمل مثل Adonis.JS لإنشاء واجهات برمجة تطبيقات RESTful.",
      "sql": "معرفة قواعد البيانات العلائقية (MySQL، PostgreSQL) لإدارة البيانات.",
      "git": "استخدام Git للتحكم في الإصدارات، مما يسهل التعاون وإدارة المشاريع.",
      "linux": "معرفة أنظمة Linux لتطوير ونشر التطبيقات.",
      "python": "استخدام Python للنصوص البرمجية، والأتمتة، وتطوير التطبيقات.",
      "java": "معرفة متقدمة في Java، تطوير تطبيقات موجهة للكائنات وإضافات Minecraft باستخدام SpigotAPI.",
      "api-rest": "إنشاء واستهلاك واجهات برمجة تطبيقات REST للتكامل بين التطبيقات المختلفة.",
      "php": "خبرة في تطوير الويب باستخدام PHP، خاصة لمشاريع إدارة المحتوى وتطبيقات الويب.",
      "c": "معرفة أساسية بلغة C، بشكل أساسي للمشاريع الأكاديمية وتمارين البرمجة."
    }
  }
}
