{
  "dir": "ltr",
  "rss": {
    "title": "Romain Bongibault - Projets",
    "description": "Découvrez les projets de Romain Bongibault",
    "generator": "Inconnu",
    "copyright": "Bongibault Romain, {year}. Tous droits réservés."
  },
  "home": {
    "metadata": {
      "title": "Bongibault Romain - Portfolio",
      "description": "Portfolio de Romain Bongibault, étudiant en informatique à l'INSA Toulouse. Découvrez mes projets, articles et expériences.",
      "keywords": "portfolio, informatique, étudiant, INSA Toulouse, projets, articles, expériences, recommandations, certificats, éducation"
    }
  },
  "components": {
    "header": {
      "title": "Romain Bongibault",
      "subtitle": "Étudiant en 5<sup>ème</sup> année en Informatique et Réseaux à l'INSA Toulouse",
      "availability": "Recherche un stage de 5ème année"
    },
    "footer": {
      "copyright": "© Bongibault Romain, {year}. Tous droits réservés."
    },
    "projects": {
      "title": "Projets"
    },
    "experience": {
      "title": "Expérience",
      "lexlau": {
        "title": "Stagiaire Développeur Full Stack",
        "date": "Juin 2025 - Août 2025",
        "location": "LexLau, 1000 Bruxelles, Belgique",
        "description": "Contribution au développement et à l'optimisation d'un CRM/CMS web (Vue.js, .NET) : ajout de fonctionnalités clés (gestion de dossiers, authentification, génération de documents), amélioration de l'interface utilisateur et des performances, tests et maintenance en collaboration avec l'équipe technique."
      },
      "gerresheimer": {
        "title": "Stagiaire Ingénieur Réseau",
        "date": "Juillet 2024 - Août 2024",
        "location": "Gerresheimer, 6590 Momignies, Belgique",
        "description": "Participation à l'optimisation des infrastructures réseau d'un site industriel : audit et renforcement de la sécurité, configuration et supervision d'équipements réseau, gestion proactive d'une baie de serveurs (patching, organisation, documentation)"
      },
      "maloc": {
        "title": "Développeur Backend",
        "date": "Juillet 2021 - Août 2021",
        "location": "Maloc, 76600 Le Havre, France",
        "description": "Développement d'une API REST robuste en Node.js avec le framework AdonisJS : modélisation de la base de données, gestion de l'authentification, création des endpoints métiers. Travail en collaboration étroite avec l'équipe Frontend pour assurer l'intégration fluide des fonctionnalités et la cohérence entre les couches applicatives."
      }
    },
    "education": {
      "title": "Éducation",
      "insa": {
        "title": "Diplôme d'ingénieur en informatique et réseaux",
        "date": "2023 - 2026",
        "location": "Institut National des Sciences Appliquées, 31400 Toulouse, France",
        "description": "Formation axée sur le développement logiciel, les réseaux, l'algorithmique et la cybersécurité. J'y ai renforcé mes compétences en programmation, en mathématiques appliquées et en gestion de projets techniques."
      },
      "faidherbe": {
        "title": "Classe Préparatoire Aux Grandes Ecoles",
        "date": "2021 - 2023",
        "location": "Lycée Faidherbe, 59034 Lille, France",
        "description": "Deux années intenses où j'ai consolidé mes bases scientifiques tout en développant une solide méthode de travail. Cette formation m'a permis de progresser en logique, en modélisation et en informatique."
      },
      "isp": {
        "title": "Baccalauréat Général",
        "date": "2018 - 2021",
        "location": "Institution Saint Pierre, 59610 Fourmies, France",
        "description": "Spécialités : Mathématiques, Physique-Chimie, SVT - Option Mathématiques expertes. Ce parcours a confirmé mon intérêt pour les sciences et préparé le terrain pour mes études d'ingénieur."
      }
    },
    "certificates": {
      "title": "Certifications",
      "web": {
        "title": "Formation de Développeur Web",
        "description": " Formation complète au développement web (HTML, CSS, JavaScript, PHP, MySQL, WordPress…) avec réalisation de projets concrets : site vitrine, blog, jeu, e-commerce, etc."
      },
      "toeic": {
        "title": "Certification TOEIC® - 885 / 990",
        "description": "Test Listening & Reading (INSA Toulouse, 2025) - Listening : 470 / Reading : 415 - Niveau avancé, score valide jusqu'en mai 2027."
      },
      "java": {
        "title": "Formation Développeur Java",
        "description": "Formation complète au développement Java (Java 8 à 17) incluant 45 ateliers pratiques, apprentissage progressif des fondamentaux orienté projet, avec introduction à Java EE, Maven et Spring Boot."
      },
      "vue": {
        "title": "Formation Complète Vue.js 3",
        "description": "Formation complète à Vue.js 3 pour maîtriser la création d'interfaces réactives, d'applications web SPA et mobiles, avec apprentissage des composants, directives, gestion d'état (Vuex, Pinia)."
      }
    },
    "skills": {
      "title": "Compétences",
      "html-css": "Maîtrise des technologies fondamentales du web, permettant de créer des sites et applications interactives et responsives.",
      "javascript": "Utilisation de JavaScript pour le développement web, avec une attention particulière à la performance et à l'expérience utilisateur.",
      "typescript": "La majorité de mes projets sont développés en TypeScript, ce qui me permet d'écrire du code plus robuste et maintenable.",
      "next-js": "Utilisation de React et Next.js pour développer des applications web modernes, performantes et optimisées (comme ce portfolio).",
      "react": "Utilisation de React pour développer des interfaces utilisateur modernes et réactives.",
      "vue-js": "Utilisation de Vue.js pour la création d'un CRM/CMS collaboratif, avec une attention particulière à la performance et à l'expérience utilisateur.",
      "node-js": "Développement d'applications backend avec Node.js, en utilisant des frameworks comme Adonis.JS pour créer des API RESTful.",
      "sql": "Connaissance des bases de données relationnelles (MySQL, PostgreSQL) pour la gestion des données.",
      "git": "Utilisation de Git pour le contrôle de version, facilitant la collaboration et la gestion des projets.",
      "linux": "Connaissance des systèmes Linux pour le développement et le déploiement d'applications.",
      "python": "Utilisation de Python pour des scripts, l'automatisation et le développement d'applications.",
      "java": "Connaissances avancées en Java, développement d'applications orientées objet et de plugins Minecraft avec SpigotAPI.",
      "api-rest": "Création et consommation d'API REST pour l'intégration entre différentes applications.",
      "php": "Expérience en développement web avec PHP, notamment pour des projets de gestion de contenu et d'applications web.",
      "c": "Connaissances de base en C, principalement pour des projets académiques et des exercices de programmation."
    }
  }
}
