{
  "home": {
    "metadata": {
      "title": "Bongibault Romain - Portfolio",
      "description": "Portfolio de Romain Bongibault, étudiant en informatique à l'INSA Toulouse. Découvrez mes projets, articles et expériences.",
      "keywords": "portfolio, informatique, étudiant, INSA Toulouse, projets, articles, expériences, recommandations, certificats, éducation"
    }
  },
  "components": {
    "experience": {
      "title": "Expérience",
      "lexlau": {
        "title": "Stagiaire Développeur Full Stack",
        "date": "Juin 2025 - Août 2025",
        "location": "LexLau, 1000 Bruxelles, Belgique",
        "description": "Contribution au développement et à l'optimisation d'un CRM/CMS web (Vue.js, .NET) : ajout de fonctionnalités clés (gestion de dossiers, authentification, génération de documents), amélioration de l'interface utilisateur et des performances, tests et maintenance en collaboration avec l'équipe technique."
      },
      "gerresheimer": {
        "title": "Stagiaire Ingénieur Réseau",
        "date": "Juillet 2024 - Août 2024",
        "location": "Gerresheimer, 6590 Momignies, Belgique",
        "description": "Participation à l'optimisation des infrastructures réseau d'un site industriel : audit et renforcement de la sécurité, configuration et supervision d'équipements réseau, gestion proactive d'une baie de serveurs (patching, organisation, documentation)"
      },
      "maloc": {
        "title": "Développeur Backend",
        "date": "Juillet 2021 - Août 2021",
        "location": "Maloc, 76600 Le Havre, France",
        "description": "Développement d'une API REST robuste en Node.js avec le framework AdonisJS : modélisation de la base de données, gestion de l'authentification, création des endpoints métiers. Travail en collaboration étroite avec l'équipe Frontend pour assurer l'intégration fluide des fonctionnalités et la cohérence entre les couches applicatives."
      }
    },
    "education": {
      "title": "Éducation",
      "insa": {
        "title": "Diplôme d'ingénieur en informatique et réseaux",
        "date": "2023 - 2026",
        "location": "Institut National des Sciences Appliquées, 31400 Toulouse, France",
        "description": "Formation axée sur le développement logiciel, les réseaux, l'algorithmique et la cybersécurité. J'y ai renforcé mes compétences en programmation, en mathématiques appliquées et en gestion de projets techniques."
      },
      "faidherbe": {
        "title": "Classe Préparatoire Aux Grandes Ecoles",
        "date": "2021 - 2023",
        "location": "Lycée Faidherbe, 59034 Lille, France",
        "description": "Deux années intenses où j'ai consolidé mes bases scientifiques tout en développant une solide méthode de travail. Cette formation m'a permis de progresser en logique, en modélisation et en informatique."
      },
      "isp": {
        "title": "Baccalauréat Général",
        "date": "2018 - 2021",
        "location": "Institution Saint Pierre, 59610 Fourmies, France",
        "description": "Spécialités : Mathématiques, Physique-Chimie, SVT - Option Mathématiques expertes. Ce parcours a confirmé mon intérêt pour les sciences et préparé le terrain pour mes études d'ingénieur."
      }
    }
  }
}
